Tekla Open API Reference for Tekla Structures 2025
Picker Methods
The Picker type exposes the following members.
Methods
Name | Description
IsInteractive
 Indicates whether the picker is interactive and currently allowed to access the UI or not. If not, then the plug-in should avoid making dialog calls or message boxes.
PickObject(String)
 Requests the user to pick one object. Returns the picked drawing object and the view in which the pick occurred.
PickObject(String, DrawingObject, ViewBase)
 Requests the user to pick one object.
PickObject(String, DrawingObject, ViewBase, Point)
 Requests the user to pick one object. Returns the picked point in addition to the picked object.
PickObject(String, Type[], DrawingObject, ViewBase, Point)
 Requests the user to pick one object of the given types. Returns the picked point in addition to the picked object.
PickObjectAndPoint
 Requests the user to pick one object. Returns the picked drawing object, the view in which the pick occurred and picked point in the view coordinates.
PickPoint(String)
 Requests the user to pick one point. Returns the picked point in the view coordinates and the view in which the pick occurred.
PickPoint(String, Point, ViewBase)
 Requests the user to pick one point.
PickPoints(StringList)
 Requests picks of points from the user. The sequence is terminated by the middle button pick. Returns the picked points in the view coordinates and the view in which the pick occurred.
PickPoints(Int32, StringList)
 Requests N picks of points from the user. Returns the picked points in the view coordinates and the view in which the pick occurred.
PickPoints(StringList, PointList, ViewBase)
 Requests picks of points from the user. The sequence is terminated by the middle button pick.
PickPoints(Int32, StringList, PointList, ViewBase)
 Requests N picks of points from the user.
PickThreePoints
 Requests a pick of three points from the user.
PickTwoPoints
 Requests a pick of two points from the user.
Top
See Also
Reference
Picker Class
Tekla.Structures.Drawing.UI Namespace